html-content/honors.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-01 Sat 19:34 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Honors project</title>
<meta name="author" content="Mathieu Renzo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./css/style.css" />
<link rel="stylesheet" href="./fontawesome-free-6.7.2-web/css/all.min.css">
<meta name="keywords" content="Mathieu, Renzo, Mathieu Renzo,
			       stellar evolution, 400A, University of
			       Arizona, Steward Observatory, stars,
			       theoretical astrophysics">
</head>
<body>
<div id="preamble" class="status">
<!-- Preamble -->
<!-- The header -->
<div class="header">

  <!-- The site name -->
  <div class="site-name">
    <a id="top" href="./index.html">Stellar Evolution</a>
  </div>

  <!-- The hamburger -->
  <div class="hamburger">
    <div id="myLinks" class="menu">
      <a href="./index.html">Home</a>
      <a href="./syllabus.html">Syllabus</a>
      <a href="./lectures.html">Lectures</a>
      <a href="./projects.html">Projects</a>
    </div>
    <a href="javascript:void(0);" class="icon" onclick="HamburgerMenuFunction()">
      <i class="fa fa-bars"></i>
    </a>
  </div>

  <div class="navbar">
    <a href="./syllabus.html">Syllabus</a>
    <a href="./lectures.html">Lectures</a>
    <a href="./projects.html">Projects</a>
  </div>
</div>

<!-- scripts -->
<script>
  function HamburgerMenuFunction() {
      var x = document.getElementById("myLinks");
      if (x.style.display === "block") {
	  x.style.display = "none";
      } else {
	  x.style.display = "block";
      }
  }
</script>

<script>
  window.onload = () => {
      const toggleButton = document.getElementById("light-dark-toggle");
      // const body = document.body;
      const html = document.html;


      // Check localStorage for user preference
      if (localStorage.getItem("theme") === "dark") {
          body.classList.add("dark-mode");
      }

      // Toggle theme on click
      toggleButton.addEventListener("click", () => {
          body.classList.toggle("dark-mode");

          // Save user preference
          if (body.classList.contains("dark-mode")) {
              localStorage.setItem("theme", "dark");
          } else {
              localStorage.setItem("theme", "light");
          }
      });
  };
</script>
<!-- end scripts-->
</div>
<div id="content" class="content">

<div id="outline-container-orgbaac53a" class="outline-2">
<h2 id="orgbaac53a"><a href="#orgbaac53a">Examples of past honor's projects</a></h2>
<div class="outline-text-2" id="text-orgbaac53a">
<p>
The honor's project consist in installing on your machine <a href="https://docs.mesastar.org/en/latest/">MESA</a>, and
use it to investigate something we will barely touch upon in class.
</p>

<p>
The list below contains some examples, if you are interested in doing
an honor's project for this class, please come talk to me to define a
scope that best fits your interests <i>and</i> the content of this class.
</p>
</div>

<div id="outline-container-orgb32d8fd" class="outline-3">
<h3 id="orgb32d8fd"><a href="#orgb32d8fd">Main sequence burning in massive population III stars</a></h3>
<div class="outline-text-3" id="text-orgb32d8fd">
<p>
Nuclear burning in massive stars occurs through the CNO cycle, which
uses metals (Carbon, Nitrogen, and Oxygen) as catalysts to stick
together 4 protons, turn two of them into neutrons, and produce
helium. However, what happens when C, N, and O are <i>not</i> available?
</p>

<p>
One physical situation where we think this may have happened is for
Population III stars, the first stars formed from pristine material
from the Big Bang: those only had H and He (and maybe some trace Li
and Be), no C, N, or O was available in the gas cloud they formed
from. <b>N.B.:</b> we have not seen these stars, but clearly at some point
they must have existed! The only way to study how they evolved for now
is through numerical simulations.
</p>

<p>
In this project you will compute with the stellar evolution code <a href="https://docs.mesastar.org/en/latest/">MESA</a>
the evolution of two 30M<sub>☉</sub> non-rotating, non-magnetic, single
stars, one at solar metallicity Z<sub>☉</sub> and one with Z=0, until the end
of hydrogen core burning, compare their evolution in terms of their
potentially observable surface properties <i>and</i> in terms of their
interior structure, and interpret the differences.
</p>
</div>

<div id="outline-container-orge55ecb3" class="outline-4">
<h4 id="orge55ecb3"><a href="#orge55ecb3">Instructions</a></h4>
<div class="outline-text-4" id="text-orge55ecb3">
<ul class="org-ul">
<li>Follow the <a href="https://docs.mesastar.org/en/latest/">MESA</a> documentation to install the code</li>
<li>Follow the tutorial to run MESA: this will be your Z<sub>☉</sub> 15M<sub>☉</sub> star!</li>
<li>By reading the documentation, figure out what to change to make
this a 30M<sub>☉</sub> star and run it until "terminal age main sequence"
(end of H core burning).</li>
<li>By reading the documentation, figure out which options to change to
set Z=0 (<b>hint</b>: there should be more than one!), and run a second,
Z=0 30M<sub>☉</sub> star (otherwise identical to the tutorial model)</li>
<li>Plot as many things as you wish to understand the physical
differences between the two models and write up a short text (&lt;4
pages including figures) with your findings. Focus on the physical
processes in the stellar interior and why they may differ, and put
them in the context of the course material.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
  <hr>
  <a href="#light-dark-toggle"><i id="light-dark-toggle"><i class="fa-solid fa-circle-half-stroke"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="#"><i class="fa-solid fa-arrow-left" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="#top"><i class="fa-solid fa-arrow-up" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="#"><i class="fa-solid fa-arrow-right" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="https://github.com/mathren/stellar_phys_400A"><i class="fa-brands fa-github" style="font-size:16px"></i></a><hr>
  <br>
  Last updated on 1 February 2025 <br>
  Made with Emacs 28.1 - Org mode 9.5.2
  <br>
</div>
</div>
</body>
</html>
